testCase/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluxScheme          Kurganov;

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default         Gauss linear;
    grad(U)         cellMDLimited Gauss linear 1;
    grad(p)         Gauss linear 0.33;
}

defaultAdvScheme     vanLeer;
defaultAdvSchemeV    vanLeerV;

divSchemes
{
    default                                         none;
    div(phi,k)                                      Gauss upwind;
    div(phi,epsilon)                                Gauss upwind;

    //momentum equation
    div(phi,U)                                      Gauss $defaultAdvSchemeV;
    div(((rho*nuEff)*dev2(T(grad(U)))))             Gauss linear;

    //energy equation
    div(phi,h)                                      Gauss $defaultAdvScheme;
    div(phi,K)                                      Gauss $defaultAdvScheme;

    //continuity equation
    div(phid,p)                                     Gauss $defaultAdvScheme;

    div(((rho*nuEff)*dev2(T(grad(U)))))             Gauss linear;

    div(meshPhi,p)                                  Gauss vanLeer;
    div((meshPhi*interpolate(thermo:psi)),pcorr)    Gauss vanLeer;

    div(((rho*U)*U))                                Gauss linear; //FWH analogy

    div(tauMC)                                      Gauss linear;
}

laplacianSchemes
{
    default                                         Gauss linear corrected;
}

interpolationSchemes
{
    default                                         linear;

    reconstruct(rho)                                $defaultAdvScheme;
    reconstruct(psi)                                $defaultAdvScheme;
    reconstruct(p)                                  $defaultAdvScheme;
    reconstruct(T)                                  $defaultAdvScheme;
    reconstruct(U)                                  $defaultAdvSchemeV;
    reconstruct(rho*U)                              $defaultAdvSchemeV;
    reconstruct(Dp)                                 $defaultAdvScheme;
}

snGradSchemes
{
    default                                         corrected;
}

fluxRequired
{
    p;
    pcorr;
}


// ************************************************************************* //
