testCase/system/probeControl
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
probes
{
    libs            (sampling);
    type            probes;
    name            probes;
    writeControl    timeStep;
    writeInterval   10;
    fields          (p  U);
    probeLocations
    (
            (-200 0.0 0.5)
            ( 200 0.0 0.5)
            (-0.5   0.0 0.5)
            ( 0.5   0.0 0.5)
            ( 0.0  -0.5 0.5)
            ( 0.0   0.5 0.5)
    );
/*
    type            sets;
    libs            (sampling);
    writeControl    timeStep;
    writeInterval   10;
    setFormat       raw;
    enabled         false;
    interpolationScheme  cellPoint;
    fields          (p  U);
    sets
    (
       probes
       {
            type   cloud;
            axis   xyz;
            points
            (
                    (-200 0.0 0.5)
                    ( 200 0.0 0.5)
                    (-0.5   0.0 0.5)
                    ( 0.5   0.0 0.5)
                    ( 0.0  -0.5 0.5)
                    ( 0.0   0.5 0.5)
            );
        }
    );
*/
}
/*
lines
{
    type           sets;
    libs           (sampling);
    writeControl   outputTime;
    setFormat      raw;
    interpolationScheme  cellPoint;
    fields         (p);
    sets
    (
        lineAbove
        {
            type      uniform;
            axis      x;
            start     (-100.0 50 0.5); 
            end       ( 100.0 50 0.5);
            nPoints   100;
        } 
        lineBelow
        {
            type      uniform;
            axis      x;
            start     (-100.0 -50 0.5); 
            end       ( 100.0 -50 0.5);
            nPoints   100;
        } 
        lineOnLeft
        {
            type      uniform;
            axis      y;
            start     (-50.0 -100.0 0.5); 
            end       (-50.0  100.0 0.5);
            nPoints   100;
        } 
        lineOnRight
        {
            type      uniform;
            axis      y;
            start     (50.0 -100.0 0.5); 
            end       (50.0  100.0 0.5);
            nPoints   100;
        } 
    );
} 
*/
